[
  {
    "ID": "01",
    "Description": "A promising young player is attracting interest. Secure this talent for your organization.",
    "Role": "Talent Scout",
    "Branch": "Operations"
  },
  {
    "ID": 53,
    "Description": "You've identified a potential superstar player in a developing esports region, but they reside in a country with complex visa regulations. You’re traveling to analyze their skill sets in person, but you have to determine if securing the proper visa and managing travel logistics are worth the risk.",
    "Role": "Talent Scout",
    "Branch": "Operations"
  },
  {
    "ID": 98,
    "Description": "The team has limited funds and can only afford to sign one new player, but there are multiple candidates who show promise. Review the players' past performance stats, injury histories, and potential for long-term success to determine which player would provide the best return on investment for the team.",
    "Role": "Talent Scout",
    "Branch": "Operations"
  },
  {
    "ID": 12,
    "Description": "Players are complaining about the quality and variety of food options at the team's training facility. Improve the food situation to boost player morale and well-being.",
    "Role": "Head Chef",
    "Branch": "Operations"
  },
  {
    "ID": 58,
    "Description": "Several players on your team follow vegetarian or vegan diets. Your current team meals lack variety and cater primarily to meat-eaters. This is leading to frustration and potentially impacting player performance.",
    "Role": "Head Chef",
    "Branch": "Operations"
  },
  {
    "ID": 99,
    "Description": "A key ingredient for tonight’s meal was accidentally left behind at the store, and there’s no time to go back. Find a way to creatively improvise with the ingredients available to ensure the meal is still nutritious, satisfying, and meets the players' dietary needs without compromising quality.",
    "Role": "Head Chef",
    "Branch": "Operations"
  },
  {
    "ID": 16,
    "Description": "The upcoming draft is crucial for your team's future. Study potential picks utilizing statistics and develop a strategic draft plan.",
    "Role": "Esports Analyst",
    "Branch": "Operations"
  },
  {
    "ID": 63,
    "Description": "Your team is headed to a major tournament, but a recent roster swap on a rival team throws your entire analysis into question. The new player's strengths and weaknesses are unknown, and your carefully crafted strategies might no longer be effective.",
    "Role": "Esports Analyst",
    "Branch": "Operations"
  },
  {
    "ID": 100,
    "Description": "The team’s recent matches have been inconsistent, and coaches are unsure why certain strategies aren't working. Analyze the team's past performance data, identify patterns or weaknesses, and provide a detailed report with actionable insights on how the team can improve its strategy and gameplay moving forward.",
    "Role": "Esports Analyst",
    "Branch": "Operations"
  },
  {
    "ID": 18,
    "Description": "A safety hazard is identified at the team's training facility. Address the issue and ensure a safe environment for players and staff.",
    "Role": "Facilities Manager",
    "Branch": "Operations"
  },
  {
    "ID": 76,
    "Description": "Your esports team is experiencing a shortage of gaming stations and peripherals in the practice facility, causing delays in their training schedule. Ensure the equipment and space are optimized to keep the team running smoothly by sourcing and managing the necessary hardware.",
    "Role": "Facilities Manager",
    "Branch": "Operations"
  },
  {
    "ID": 101,
    "Description": "The team’s practice space has become overcrowded, and some equipment is not being stored properly, leading to delays and safety concerns. Develop a plan to reorganize the facility, maximize space efficiency, and ensure that all equipment is properly stored, easily accessible, and ready for use at all times.",
    "Role": "Facilities Manager",
    "Branch": "Operations"
  },
  {
    "ID": 19,
    "Description": "Sales of your team's branded gaming peripherals have been declining. Develop a strategy to reignite customer interest and boost sales.",
    "Role": "Product Manager",
    "Branch": "Operations"
  },
  {
    "ID": 77,
    "Description": "The team’s new gaming peripherals line has received mixed reviews from early users, with some complaints about the design and usability. You need to gather feedback, work with design and development teams, and ensure the next product update meets user expectations while staying on schedule",
    "Role": "Product Manager",
    "Branch": "Operations"
  },
  {
    "ID": 102,
    "Description": "The team is preparing to launch a new esports-related product, but there’s a debate over which features to prioritize. Conduct market research, analyze player feedback, and work with the development team to determine which features will have the most impact on player satisfaction and product success. Present a plan to ensure the product meets both market demand and team goals.",
    "Role": "Product Manager",
    "Branch": "Operations"
  },
  {
    "ID": 23,
    "Description": "Several players on your team are experiencing fatigue and a decline in stamina during matches. Develop a meal plan to improve their energy levels and overall performance.",
    "Role": "Nutritionist",
    "Branch": "Operations"
  },
  {
    "ID": 78,
    "Description": "Players have started requesting personalized meal plans based on their individual preferences, including specific diets like vegan, keto, and gluten-free. Create a system to manage diverse dietary needs without compromising the quality and availability of meals for the whole team..",
    "Role": "Nutritionist",
    "Branch": "Operations"
  },
  {
    "ID": 103,
    "Description": "The players are feeling fatigued and are unsure if their current vitamin and supplement routine is supporting their performance. Research and recommend a new supplement plan that can boost energy, focus, and overall health, while ensuring it’s safe, effective, and tailored to the individual needs of each player.",
    "Role": "Nutritionist",
    "Branch": "Operations"
  },
  {
    "ID": 24,
    "Description": "The venue for your team's upcoming major tournament has unexpectedly been canceled due to unforeseen circumstances. Find a new venue, secure logistics, and ensure a smooth event experience for players, fans, and sponsors.",
    "Role": "Event Manager",
    "Branch": "Operations"
  },
  {
    "ID": 72,
    "Description": "Your esports organization is hosting a major Fornite tournament and needs a venue to accommodate a large audience.",
    "Role": "Event Manager",
    "Branch": "Operations"
  },
  {
    "ID": 104,
    "Description": "The event is quickly approaching, but the venue has informed you that there isn’t enough seating to accommodate the expected audience. Develop a plan to maximize seating capacity, whether through creative rearrangements, additional seating options, or a virtual viewing experience, while maintaining a positive and comfortable environment for both the players and fans.",
    "Role": "Event Manager",
    "Branch": "Operations"
  },
  {
    "ID": 39,
    "Description": "Your team's performance has dipped. Players seem sluggish, out of shape, and their endurance is lacking.",
    "Role": "Fitness Coach",
    "Branch": "Operations"
  },
  {
    "ID": 79,
    "Description": "Several players are experiencing wrist and back strain from long hours of gaming, which is starting to affect their performance. Develop a routine that focuses on preventing repetitive strain injuries while improving overall physical health to support long-term gaming performance",
    "Role": "Fitness Coach",
    "Branch": "Operations"
  },
  {
    "ID": 105,
    "Description": "The team is preparing for a major tournament in a fast-paced, reflex-intensive game, and players are struggling to maintain their stamina during long matches. Design a fitness program tailored to improving their endurance, reaction time, and mental focus, specifically for this game title.",
    "Role": "Fitness Coach",
    "Branch": "Operations"
  },
  {
    "ID": 42,
    "Description": "Your team's recent trips have been plagued by logistical nightmares. Missed flights, lost luggage, and disorganized schedules are causing frustration and player fatigue.",
    "Role": "Travel Coordinator",
    "Branch": "Operations"
  },
  {
    "ID": 80,
    "Description": "The team has a major tournament coming up in a different time zone, and several players have struggled with jet lag during past events. Plan the travel itinerary to minimize jet lag and ensure the team arrives well-rested and ready to compete.",
    "Role": "Travel Coordinator",
    "Branch": "Operations"
  },
  {
    "ID": 106,
    "Description": "The team’s upcoming tournament is in an unfamiliar city, and there are concerns about travel logistics and lodging. Plan an efficient travel itinerary that ensures the team arrives on time, has comfortable accommodations, and minimizes fatigue while staying within the budget.",
    "Role": "Travel Coordinator",
    "Branch": "Operations"
  },
  {
    "ID": 43,
    "Description": "During a recent tournament, your team's equipment malfunctioned at a critical moment. Players were frustrated, and the overall performance suffered.",
    "Role": "Equipment Manager",
    "Branch": "Operations"
  },
  {
    "ID": 81,
    "Description": "Several players have reported discomfort using the team's standard gaming chairs during long practice sessions. Research and recommend ergonomic gaming equipment that can improve player comfort and performance while staying within the organization's budget.",
    "Role": "Equipment Manager",
    "Branch": "Operations"
  },
  {
    "ID": 107,
    "Description": "The team’s gaming gear is up for an upgrade, but budget limitations mean only certain equipment can be replaced this season. Prioritize which pieces of gear need immediate replacement based on their impact on player performance, and develop a plan to maintain the rest with minimal downtime.",
    "Role": "Equipment Manager",
    "Branch": "Operations"
  },
  {
    "ID": 49,
    "Description": "A critical player on your esports team is demanding a significant raise and threatening to leave for a competitor if their demands aren't met. Their skills are vital to the team's success, but their salary demands could disrupt your budget.",
    "Role": "HR Manager",
    "Branch": "Operations"
  },
  {
    "ID": 82,
    "Description": "Players are struggling with work-life balance due to demanding practice schedules. Propose a solution to improve well-being and maintain performance.",
    "Role": "HR Manager",
    "Branch": "Operations"
  },
  {
    "ID": 108,
    "Description": "Several team members are experiencing conflicts due to cultural differences within the roster. Develop a plan to foster better communication and collaboration across diverse backgrounds..",
    "Role": "HR Manager",
    "Branch": "Operations"
  },
  {
    "ID": "02",
    "Description": "A recent social media post from a member of your organization has sparked outrage online. Mitigate the damage and protect your brand reputation.",
    "Role": "Social Media Manager",
    "Branch": "Marketing"
  },
  {
    "ID": 52,
    "Description": "A brand-new social media platform specifically for esports has exploded in popularity. Fans are demanding you join the platform, but you're unsure if it aligns with your team's current strategy and resource allocation.",
    "Role": "Social Media Manager",
    "Branch": "Marketing"
  },
  {
    "ID": 109,
    "Description": "The team’s social media engagement has dropped recently, and fans are less active in discussions. Create a strategy to boost engagement by developing content that resonates with the fanbase and increases interaction across all platforms.",
    "Role": "Social Media Manager",
    "Branch": "Marketing"
  },
  {
    "ID": "06",
    "Description": "Your game's visuals are outdated and lackluster. Improve the aesthetics to attract new players.",
    "Role": "3D Artist/Animator",
    "Branch": "Marketing"
  },
  {
    "ID": 57,
    "Description": "Your esports organization needs a mascot to create a more recognizable and engaging brand identity. However, striking the right balance between fierce competitor, relatable personality, and visual appeal for a diverse fanbase is proving to be a challenge.",
    "Role": "3D Artist/Animator",
    "Branch": "Marketing"
  },
  {
    "ID": 110,
    "Description": "The team is developing a new virtual training environment to simulate in-game scenarios. Create 3D assets and animations that replicate the game’s look and feel to help players improve their performance during practice.",
    "Role": "3D Artist/Animator",
    "Branch": "Marketing"
  },
  {
    "ID": "08",
    "Description": "A major sponsor for your org makes headlines for negative reasons. Mitigate the damage to your organization's reputation.",
    "Role": "Public Relations Specialist",
    "Branch": "Marketing"
  },
  {
    "ID": 83,
    "Description": "One of the team’s players made a controversial statement on social media, sparking negative attention from fans and sponsors. Develop a strategy to manage the situation, repair the team's public image, and communicate effectively with the media and fans.",
    "Role": "Public Relations Specialist",
    "Branch": "Marketing"
  },
  {
    "ID": 111,
    "Description": "The team is launching a new community initiative to engage with local fans. Develop a strategy that includes partnerships with local organizations, press releases, and social media campaigns to promote the event and build a stronger connection with the community.",
    "Role": "Public Relations Specialist",
    "Branch": "Marketing"
  },
  {
    "ID": 10,
    "Description": "A controversial decision by the organization sparks outrage among the fanbase. Address concerns and maintain a positive community relationship",
    "Role": "Community Manager",
    "Branch": "Marketing"
  },
  {
    "ID": 62,
    "Description": "A heated argument erupts on your team's Discord channel after a disappointing loss. Fans are blaming specific players, resorting to personal attacks and toxic language. The situation is spiraling out of control, and the team's image is at risk.",
    "Role": "Community Manager",
    "Branch": "Marketing"
  },
  {
    "ID": 112,
    "Description": "Fan engagement has dropped. Develop a plan to boost interaction and keep the community active through events and exclusive content.",
    "Role": "Community Manager",
    "Branch": "Marketing"
  },
  {
    "ID": 11,
    "Description": "Your latest marketing campaign visuals are underwhelming and fail to resonate with the target audience. Redesign the campaign for maximum impact.",
    "Role": "Graphic Designer",
    "Branch": "Marketing"
  },
  {
    "ID": 67,
    "Description": "Your esports organization's current logo feels outdated and doesn't reflect the team's current identity or competitive spirit. You need a fresh logo design that resonates with fans, is visually striking for merchandise, and translates well across various digital platforms.",
    "Role": "Graphic Designer",
    "Branch": "Marketing"
  },
  {
    "ID": 113,
    "Description": "The team is collaborating with a new sponsor for an upcoming merchandise line. Design a series of product mockups, including T-shirts, hats, and accessories, that integrate the sponsor's brand while staying true to the team’s identity.",
    "Role": "Graphic Designer",
    "Branch": "Marketing"
  },
  {
    "ID": 35,
    "Description": "Viewership for your team's official Twitch stream has been steadily declining. Develop a strategy to reignite audience engagement and boost stream popularity.",
    "Role": "Influencer",
    "Branch": "Marketing"
  },
  {
    "ID": 71,
    "Description": "Your esports organization needs a significant boost in viewership and brand awareness. You're looking for a new partner with a massive following.",
    "Role": "Influencer",
    "Branch": "Marketing"
  },
  {
    "ID": 114,
    "Description": "The team has just signed a major sponsorship deal and needs help promoting it. Create a strategy to leverage your personal brand and social media platforms to promote the partnership and generate buzz among your followers.",
    "Role": "Influencer",
    "Branch": "Marketing"
  },
  {
    "ID": 36,
    "Description": "Your team's social media posts lack visual punch. Engagement is down, and you're failing to capture the energy of your players and the game.",
    "Role": "Photographer",
    "Branch": "Marketing"
  },
  {
    "ID": 84,
    "Description": "The team has an upcoming major event, and they want to capture content that stands out on social media. Create a plan to take dynamic, high-quality stills that highlight the players, the energy of the event, and the team's brand identity for maximum engagement.",
    "Role": "Photographer",
    "Branch": "Marketing"
  },
  {
    "ID": 115,
    "Description": "The team is collaborating with a fashion brand for a photoshoot to launch a new merchandise line. Plan and capture visually striking images that showcase the products while highlighting the team’s style and personality.",
    "Role": "Photographer",
    "Branch": "Marketing"
  },
  {
    "ID": 37,
    "Description": "Your YouTube channel's viewership is stagnant. Content feels repetitive, and you're struggling to attract new fans.",
    "Role": "Videographer",
    "Branch": "Marketing"
  },
  {
    "ID": 85,
    "Description": "The team wants to create a highlight reel for their latest tournament to showcase their skills and attract new sponsors. Develop a plan to capture and edit footage that not only highlights key moments from the event but also tells a compelling story about the team's journey and achievements.",
    "Role": "Videographer",
    "Branch": "Marketing"
  },
  {
    "ID": 116,
    "Description": "The team is releasing a documentary series that follows their journey to the championship. Capture behind-the-scenes footage, interviews, and key moments, while ensuring the footage aligns with the team’s brand and storytelling goals.",
    "Role": "Videographer",
    "Branch": "Marketing"
  },
  {
    "ID": 41,
    "Description": "Your esports content feels flat. You're struggling to create engaging video scripts or captivating storylines for your shows and programs.",
    "Role": "Scriptwriter",
    "Branch": "Marketing"
  },
  {
    "ID": 86,
    "Description": "The team is producing a promotional video to build excitement for the upcoming season and needs a compelling narrative. Create a storyline that effectively conveys the organization’s mission, showcases key players, and engages fans while incorporating elements of humor and drama to keep the audience hooked.",
    "Role": "Scriptwriter",
    "Branch": "Marketing"
  },
  {
    "ID": 117,
    "Description": "The team is preparing a promotional video for an upcoming tournament. Create a narrative that introduces the team, highlights key moments, and energizes the audience while staying true to the team’s tone and brand.",
    "Role": "Scriptwriter",
    "Branch": "Marketing"
  },
  {
    "ID": 44,
    "Description": "Your esports team's media coverage is lacking. You're struggling to generate buzz and secure interviews with major publications and esports websites.",
    "Role": "Journalist",
    "Branch": "Marketing"
  },
  {
    "ID": 87,
    "Description": "The organization has announced a new player signing, and fans are eager for insights. Develop an engaging article that not only covers the details of the signing but also includes interviews with the player and coaching staff, providing context on what this means for the team’s future.",
    "Role": "Journalist",
    "Branch": "Marketing"
  },
  {
    "ID": 118,
    "Description": "The team has faced some recent setbacks, and fans are questioning their performance. Write a piece that addresses the challenges, highlights the players’ determination to bounce back, and provides insight into the team's strategy moving forward.",
    "Role": "Journalist",
    "Branch": "Marketing"
  },
  {
    "ID": 47,
    "Description": "Your team's YouTube channel and social media content are failing to capture a wider audience. You need fresh ideas and engaging formats to attract new fans and grow your online community.",
    "Role": "Content Creator",
    "Branch": "Marketing"
  },
  {
    "ID": 88,
    "Description": "Develop a series of videos and social media posts that showcase behind-the-scenes moments, player personalities, and team culture to enhance fan engagement and attract new followers.",
    "Role": "Content Creator",
    "Branch": "Marketing"
  },
  {
    "ID": 119,
    "Description": "The team is preparing for a high-stakes event, and the fans are anxious. Create a motivational content that builds anticipation, highlights the team’s preparation, and connects emotionally with the audience, encouraging them to show their support",
    "Role": "Content Creator",
    "Branch": "Marketing"
  },
  {
    "ID": "03",
    "Description": "Friction is brewing between two of your star players, potentially affecting team morale and performance. Address the situation and foster a positive team environment.",
    "Role": "Team Manager",
    "Branch": "Management"
  },
  {
    "ID": 56,
    "Description": "Two of your star players got caught up in a surprise LAN party the night before a major tournament. They arrive late, tired, and underprepared. You need to make a quick decision to ensure a competitive showing for the team.",
    "Role": "Team Manager",
    "Branch": "Management"
  },
  {
    "ID": 120,
    "Description": "Several players are struggling with maintaining their practice schedules while balancing personal commitments. Develop a plan to adjust the schedule and improve time management to keep the team on track for the upcoming tournament",
    "Role": "Team Manager",
    "Branch": "Management"
  },
  {
    "ID": "04",
    "Description": "A critical player on your team has been underperforming recently. Their morale seems low, and their gameplay has suffered. Investigate the cause and develop a plan to get them back on track.",
    "Role": "Psychologist",
    "Branch": "Management"
  },
  {
    "ID": 51,
    "Description": "One of your star players has been underperforming recently. They seem withdrawn and unfocused during practice, and their in-game decision-making is shaky. You suspect they might be struggling with personal issues impacting their mental well-being and gameplay.",
    "Role": "Psychologist",
    "Branch": "Management"
  },
  {
    "ID": 121,
    "Description": "After several close losses, the team’s confidence has dropped, affecting performance in practice. Design a mental resilience program to help players rebuild their confidence and approach future matches with a stronger mindset",
    "Role": "Psychologist",
    "Branch": "Management"
  },
  {
    "ID": "07",
    "Description": "The team's morale is low after a key leader's departure. Reinvigorate the team spirit and maintain focus.",
    "Role": "Team Captain",
    "Branch": "Management"
  },
  {
    "ID": 61,
    "Description": "Big tournament, big rivals. Your team's strategy meeting goes sideways as a key player proposes a risky tactic that divides the team.",
    "Role": "Team Captain",
    "Branch": "Management"
  },
  {
    "ID": 122,
    "Description": "With a tough stretch of games ahead, the team’s morale is slipping. As a leader, you need to set the tone by demonstrating strong work ethic, positive attitude, and resilience in both practice and matches. Show the team how to stay focused, overcome adversity, and keep a winning mindset.",
    "Role": "Team Captain",
    "Branch": "Management"
  },
  {
    "ID": "09",
    "Description": "Your team's recent strategy backfired, resulting in a loss. Analyze the situation and develop a new approach.",
    "Role": "Head Coach",
    "Branch": "Management"
  },
  {
    "ID": 123,
    "Description": "One of the team’s star players has been frequently clashing with other members, disrupting team dynamics. Develop a strategy to address these conflicts, improve communication, and ensure the team can work together cohesively during practice and competitions.",
    "Role": "Head Coach",
    "Branch": "Management"
  },
  {
    "ID": 124,
    "Description": "During a critical match, a detailed strategy has been set, but players are hesitant to fully execute it. Foster trust in their abilities, encourage them to take ownership, and empower them to make adjustments as needed during the game.",
    "Role": "Head Coach",
    "Branch": "Management"
  },
  {
    "ID": 13,
    "Description": "Several players seem to have reached a performance plateau. Develop a plan to help them break through and reach their full potential.",
    "Role": "Performance Coach",
    "Branch": "Management"
  },
  {
    "ID": 125,
    "Description": "One player struggles with performance anxiety during critical matches. Create a personalized plan to help them manage their stress, enhance focus, and build confidence to perform at their best when it matters most.",
    "Role": "Performance Coach",
    "Branch": "Management"
  },
  {
    "ID": 126,
    "Description": "One of the players has been performing exceptionally well, but their success seems to be isolating them from the rest of the team, affecting overall synergy. Develop a strategy to help the player maintain their high performance while ensuring they integrate well with the team’s dynamics.",
    "Role": "Performance Coach",
    "Branch": "Management"
  },
  {
    "ID": 25,
    "Description": "The esports landscape is rapidly evolving, with new games and leagues emerging. Develop a long-term strategy to ensure your organization remains competitive and relevant within the esports ecosystem.",
    "Role": "General Manager",
    "Branch": "Management"
  },
  {
    "ID": 66,
    "Description": "Your esports team is stagnating. Viewership is declining, sponsorships are drying up, and your current roster lacks the star power and personality to capture fan attention. You need to revitalize the brand and inject new energy into the team to remain competitive and commercially relevant.",
    "Role": "General Manager",
    "Branch": "Management"
  },
  {
    "ID": 127,
    "Description": "The team is experiencing internal conflict due to differing visions on the future of the organization. Mediate a solution that aligns all team members with a common goal while keeping everyone motivated and focused on the organization’s long-term success.",
    "Role": "General Manager",
    "Branch": "Management"
  },
  {
    "ID": 38,
    "Description": "Your recent esports tournaments have been plagued by technical difficulties and logistical nightmares. Stream quality is inconsistent, and the overall experience feels unprofessional.",
    "Role": "Production Manager",
    "Branch": "Management"
  },
  {
    "ID": 70,
    "Description": "Your organization is hosting a major Rocket League tournament. You need a manager to craft a plan that delivers a professional and engaging live experience for viewers and a smooth operation for the competing teams.",
    "Role": "Production Manager",
    "Branch": "Management"
  },
  {
    "ID": 128,
    "Description": "During a live event, a critical piece of equipment fails, causing a major delay. You need to find a quick solution to get things back on track without disrupting the event's flow or audience engagement.",
    "Role": "Production Manager",
    "Branch": "Management"
  },
  {
    "ID": 40,
    "Description": "Your esports facility's attendance is dropping. Tournaments and events feel repetitive, and you're failing to attract new visitors and keep them engaged.",
    "Role": "Program Manager",
    "Branch": "Management"
  },
  {
    "ID": 129,
    "Description": "The event program is getting too packed, and there's a debate on which activities should be included. Select the most engaging and valuable elements to ensure a balanced, exciting, and impactful event",
    "Role": "Program Manager",
    "Branch": "Management"
  },
  {
    "ID": 130,
    "Description": "You're tasked with working alongside interns to design the new program curriculum for the upcoming year. Ensure their ideas align with organizational goals while guiding them to create a fresh, innovative curriculum that engages students effectively.",
    "Role": "Program Manager",
    "Branch": "Management"
  },
  {
    "ID": 46,
    "Description": "Your esports organization is developing a new mobile game, but the project is behind schedule and exceeding budget. Deadlines are looming, and morale is flagging.",
    "Role": "Project Manager",
    "Branch": "Management"
  },
  {
    "ID": 75,
    "Description": "Your esports organization needs a clear roadmap for the year. You lack a comprehensive plan that outlines competitive goals, content strategy, budget allocation, and potential growth opportunities.",
    "Role": "Project Manager",
    "Branch": "Management"
  },
  {
    "ID": 131,
    "Description": "A project deadline is fast approaching, but key team members are unavailable due to unforeseen circumstances. Reorganize tasks, manage resources, and communicate with stakeholders to ensure the project is still delivered on time.",
    "Role": "Project Manager",
    "Branch": "Management"
  },
  {
    "ID": 48,
    "Description": "Your head coach seems overwhelmed, struggling to manage practice sessions and provide individualized feedback to all players. Player performance is inconsistent, and team morale is dipping.",
    "Role": "Assistant Coach",
    "Branch": "Management"
  },
  {
    "ID": 89,
    "Description": "Develop a plan to work closely with individual players, provide targeted feedback, and help them refine their skills to improve overall team performance",
    "Role": "Assistant Coach",
    "Branch": "Management"
  },
  {
    "ID": 132,
    "Description": "The head coach is overwhelmed with managing the team during a high-pressure match. Step in to help with strategy adjustments, communicate with players, and ensure the team stays focused and on track",
    "Role": "Assistant Coach",
    "Branch": "Management"
  },
  {
    "ID": "05",
    "Description": "Bugs and glitches plague the latest game update. Fix the issues and restore player trust.",
    "Role": "Game Designer",
    "Branch": "Technology"
  },
  {
    "ID": 55,
    "Description": "Your studio's next big game is planned for a brand new console with unproven market potential and limited technical specifications. You need to design a game that leverages the console's unique features while still delivering an engaging and innovative experience for fans.",
    "Role": "Game Designer",
    "Branch": "Technology"
  },
  {
    "ID": 133,
    "Description": "Players are reporting that the game’s difficulty level feels inconsistent, making some parts too easy while others are too difficult. Adjust the game mechanics and balance to ensure a smooth, challenging experience for all players.",
    "Role": "Game Designer",
    "Branch": "Technology"
  },
  {
    "ID": 14,
    "Description": "During a critical live stream, technical problems cause the transmission to crash. Minimize downtime and ensure a smooth viewing experience.",
    "Role": "Broadcast Engineer",
    "Branch": "Technology"
  },
  {
    "ID": 60,
    "Description": "Viewers are met with a frozen image or error message, and frustration is mounting on social media. You need to identify the cause of the issue and get the stream back online quickly to minimize lost viewership and maintain fan engagement.",
    "Role": "Broadcast Engineer",
    "Branch": "Technology"
  },
  {
    "ID": 134,
    "Description": "The live broadcast is set to feature multiple camera angles, but one of the cameras is malfunctioning. You must reconfigure the remaining cameras and adjust the feed to maintain an engaging viewing experience while working with limited resources.",
    "Role": "Broadcast Engineer",
    "Branch": "Technology"
  },
  {
    "ID": 15,
    "Description": "A security breach has compromised sensitive player and team data. Contain the damage and prevent further leaks.",
    "Role": "Cybersecurity Analyst",
    "Branch": "Technology"
  },
  {
    "ID": 65,
    "Description": "A critical phishing email targeting employee login credentials lands in several inboxes within your esports organization. You suspect some team members might click the malicious link, compromising sensitive data and potentially disrupting operations.",
    "Role": "Cybersecurity Analyst",
    "Branch": "Technology"
  },
  {
    "ID": 135,
    "Description": "A potential security breach has been detected during a live event. Your task is to assess the threat, secure sensitive data, and prevent the breach from affecting the event while ensuring minimal disruption to the audience experience.",
    "Role": "Cybersecurity Analyst",
    "Branch": "Technology"
  },
  {
    "ID": 17,
    "Description": "A critical hardware failure disrupts practice for the team. Orchestrate a plan to get the equipment back online and minimize practice downtime.",
    "Role": "IT Coordinator",
    "Branch": "Technology"
  },
  {
    "ID": 69,
    "Description": "Your esports training facility's internet connection is struggling to keep up with the growing demands of the team. Frequent lag and dropped connections are disrupting practice sessions and scrims, hindering player performance. You need to upgrade the network infrastructure to ensure a smooth and reliable online experience.",
    "Role": "IT Coordinator",
    "Branch": "Technology"
  },
  {
    "ID": 136,
    "Description": "A system crash disrupts practice. You must manage the technical support team to quickly identify and resolve the issue. How do you prioritize tasks and ensure minimal downtime?",
    "Role": "IT Coordinator",
    "Branch": "Technology"
  },
  {
    "ID": 20,
    "Description": "Your team's online merchandise store is overloaded with traffic during a sale, causing crashes and frustrated fans. Resolve the technical issues and ensure a smooth buying experience.",
    "Role": "Technical Support",
    "Branch": "Technology"
  },
  {
    "ID": 90,
    "Description": "The team is upgrading to a new gaming software that players are unfamiliar with, leading to confusion and delays in practice. Implement a system to train players on the new software, troubleshoot any issues that arise, and ensure a seamless transition for the entire team.",
    "Role": "Technical Support",
    "Branch": "Technology"
  },
  {
    "ID": 137,
    "Description": "Players are facing connectivity issues during practice. You discover unstable Wi-Fi signals in certain areas. How will you resolve the issue and restore smooth gameplay?",
    "Role": "Technical Support",
    "Branch": "Technology"
  },
  {
    "ID": 21,
    "Description": "A security breach has infiltrated your organization's cloud storage system, potentially compromising sensitive data. Mitigate the damage and prevent further attacks.",
    "Role": "Cloud Security Engineer",
    "Branch": "Technology"
  },
  {
    "ID": 91,
    "Description": "Design a strategy to safeguard live streams from hacking attempts and ensure the privacy of fan information during these digital engagements.",
    "Role": "Cloud Security Engineer",
    "Branch": "Technology"
  },
  {
    "ID": 138,
    "Description": "The team is transitioning from desktop storage to cloud-based systems. You need to move all critical data while ensuring it’s organized and easy to access. How do you plan the migration to ensure security, efficiency, and accessibility?",
    "Role": "Cloud Security Engineer",
    "Branch": "Technology"
  },
  {
    "ID": 22,
    "Description": "A critical bug in your team's game is causing crashes and frustrating players. Fix the bug and ensure a smooth gameplay experience.",
    "Role": "Software Engineer",
    "Branch": "Technology"
  },
  {
    "ID": 74,
    "Description": "Your custom training software crashes during practice, corrupting data and stalling player progress.",
    "Role": "Software Engineer",
    "Branch": "Technology"
  },
  {
    "ID": 139,
    "Description": "The development team is transitioning to a new platform that requires proficiency in a coding language you are unfamiliar with. You have a tight deadline to integrate a key feature using this new language.",
    "Role": "Software Engineer",
    "Branch": "Technology"
  },
  {
    "ID": 34,
    "Description": "The pre-match player introductions are a major spectacle for the home crowd, but the current lighting setup doesn't adequately highlight the players or create a dynamic atmosphere. Revamp the lighting design to enhance the player introductions and energize the audience.",
    "Role": "Lighting Technician",
    "Branch": "Technology"
  },
  {
    "ID": 92,
    "Description": "Adjust the lighting to create dramatic and visually appealing shots that showcase both the players and their gear in the best possible light for promotional materials.",
    "Role": "Lighting Technician",
    "Branch": "Technology"
  },
  {
    "ID": 140,
    "Description": "The venue has a last-minute lighting change request for an important event. You need to adjust the setup quickly to enhance the visual experience, but some of the equipment isn't working properly.",
    "Role": "Lighting Technician",
    "Branch": "Technology"
  },
  {
    "ID": 50,
    "Description": "Fans at a recent tournament couldn't hear the casters or game due to a bad audio mix. Streams are flooded with complaints, and the event feels unprofessional.",
    "Role": "Sound Engineer",
    "Branch": "Technology"
  },
  {
    "ID": 93,
    "Description": "The team is preparing for a virtual event with interactive fan participation, but the microphone setup is causing feedback issues during live Q&A sessions. Find a solution to eliminate the feedback, ensuring clear communication between the players and fans without interruptions or distortion.",
    "Role": "Sound Engineer",
    "Branch": "Technology"
  },
  {
    "ID": 141,
    "Description": "During a live event, the audio levels fluctuate unexpectedly, causing distortion and delays in the broadcast. You must quickly identify the source of the issue and stabilize the sound without disrupting the flow of the event.",
    "Role": "Sound Engineer",
    "Branch": "Technology"
  },
  {
    "ID": 26,
    "Description": "Your team's current sponsorship deals are expiring, and you're struggling to attract new partners. Develop a strategy to secure lucrative sponsorships and generate new revenue streams.",
    "Role": "Business Developer",
    "Branch": "Finance"
  },
  {
    "ID": 54,
    "Description": "Your team's current headset sponsor is a good fit, but their contract is expiring. Negotiations are stalling - they're offering a lower renewal rate, and other major headset brands are expressing interest. You need to decide whether to re-sign with a familiar partner or explore potentially lucrative new deals.",
    "Role": "Business Developer",
    "Branch": "Finance"
  },
  {
    "ID": 142,
    "Description": "A new competitor has entered the market, offering similar services at a lower price point. Your company needs to maintain its position and grow its client base. You must find a way to create a new business opportunity or partnership that differentiates your services and attracts potential clients.",
    "Role": "Business Developer",
    "Branch": "Finance"
  },
  {
    "ID": 27,
    "Description": "A key player's contract negotiations have stalled due to disagreements over specific terms. Navigate the legal complexities and reach a fair agreement that satisfies both the player and the organization.",
    "Role": "Lawyer",
    "Branch": "Finance"
  },
  {
    "ID": 59,
    "Description": "Your esports organization's logo design is being accused of copyright infringement by a rival team. You believe your logo is original, but a lawsuit is looming. Going to court is expensive and time-consuming, but losing could force a rebrand and damage your image.",
    "Role": "Lawyer",
    "Branch": "Finance"
  },
  {
    "ID": 143,
    "Description": "A dispute has arisen between two teams over a contract that contains ambiguous terms. Both sides are pushing for a resolution that favors their interests. You must review the contract, analyze the key points of contention, and provide a strategy that resolves the conflict while protecting your client’s best interests.",
    "Role": "Lawyer",
    "Branch": "Finance"
  },
  {
    "ID": 28,
    "Description": "Unexpected expenses have thrown your team's budget out of whack. Identify cost-saving opportunities and ensure the financial health of the organization.",
    "Role": "Accountant",
    "Branch": "Finance"
  },
  {
    "ID": 64,
    "Description": "The upcoming season promises exciting new opportunities like player acquisitions and travel for international tournaments. However, your current esports organization budget is stretched thin. You need to create a realistic and flexible budget that caters to growth aspirations while staying financially responsible.",
    "Role": "Accountant",
    "Branch": "Finance"
  },
  {
    "ID": 144,
    "Description": "The esports organization has just added new teams to represent additional game titles, significantly increasing both the revenue and expenses. Your task is to reorganize the financial records to accommodate these changes.",
    "Role": "Accountant",
    "Branch": "Finance"
  },
  {
    "ID": 29,
    "Description": "An angry fan posts a negative review about the team on social media, sparking outrage and damaging your brand reputation. Address the fan's concerns, de-escalate the situation, and protect the team's image.",
    "Role": "Customer Support",
    "Branch": "Finance"
  },
  {
    "ID": 68,
    "Description": "A major tournament your organization is hosting gets canceled unexpectedly. Fans who purchased tickets are frustrated and demanding refunds. Your org is facing a surge of inquiries and needs to handle them efficiently while maintaining a positive brand image.",
    "Role": "Customer Support",
    "Branch": "Finance"
  },
  {
    "ID": 145,
    "Description": "A fan at a live event has expressed frustration about poor service and is considering leaving early. They feel their experience is not meeting expectations. You need to resolve the situation quickly, offering a solution that not only satisfies the fan but also preserves the event’s reputation.",
    "Role": "Customer Support",
    "Branch": "Finance"
  },
  {
    "ID": 30,
    "Description": "A star player on your team is nearing the end of their contract and has received lucrative offers from other organizations. Negotiate a new contract that retains the player while staying within the team's budget.",
    "Role": "Esports Agent",
    "Branch": "Finance"
  },
  {
    "ID": 73,
    "Description": "You're negotiating a brand deal for your star player with a major sports drink company.",
    "Role": "Esports Agent",
    "Branch": "Finance"
  },
  {
    "ID": 146,
    "Description": "An athlete is unhappy with their contract, feeling unsupported and considering leaving. How do you resolve the issue, balancing the athlete's concerns with the organization’s needs?",
    "Role": "Esports Agent",
    "Branch": "Finance"
  },
  {
    "ID": 31,
    "Description": "Existing sponsors are expressing dissatisfaction with the return on investment (ROI) from their sponsorships. Develop creative activation strategies to reignite their enthusiasm and maximize the value proposition.",
    "Role": "Sponsorship Coordinator",
    "Branch": "Finance"
  },
  {
    "ID": 94,
    "Description": "One of the team’s main sponsors is concerned that their brand isn’t getting enough visibility during live streams and events. Create a plan to increase sponsor exposure through strategic placements, player mentions, and event branding, ensuring that the sponsor feels fully integrated with the team’s activities.",
    "Role": "Sponsorship Coordinator",
    "Branch": "Finance"
  },
  {
    "ID": 147,
    "Description": "A potential sponsor offers a large sum, but their brand doesn't align with the team's values. How do you handle this situation while maintaining the team’s integrity and future partnerships?",
    "Role": "Sponsorship Coordinator",
    "Branch": "Finance"
  },
  {
    "ID": 32,
    "Description": "Team expenses have been steadily increasing over the past year, despite flat revenue growth. Identify areas where costs can be controlled and ensure the organization remains financially sustainable.",
    "Role": "Financial Analyst",
    "Branch": "Finance"
  },
  {
    "ID": 95,
    "Description": "The team is considering a new partnership, but the projected revenue from this deal is unclear. Analyze the financial impact of the partnership, including potential risks and long-term benefits, and provide a recommendation on whether the deal aligns with the team's budget and growth goals.",
    "Role": "Financial Analyst",
    "Branch": "Finance"
  },
  {
    "ID": 148,
    "Description": "The team is considering a major investment that could change the direction of the organization. You need to create a 10-year projection of the financial impact, considering both risks and potential rewards.",
    "Role": "Financial Analyst",
    "Branch": "Finance"
  },
  {
    "ID": 33,
    "Description": "An unexpected cash flow shortage threatens the organization's ability to meet upcoming financial obligations. Develop a plan to secure immediate funding and stabilize the team's financial health.",
    "Role": "Treasurer",
    "Branch": "Finance"
  },
  {
    "ID": 96,
    "Description": "The team is considering an investment in new technology to improve player performance, but the costs are significant. Create a financial forecast to evaluate whether the investment will yield a positive return, and recommend the best approach for financing the purchase without jeopardizing the team’s financial stability.",
    "Role": "Treasurer",
    "Branch": "Finance"
  },
  {
    "ID": 149,
    "Description": "The organization is expanding and starting a new venture. You’ve been tasked with opening a new bank account to manage the funds for this new project.",
    "Role": "Treasurer",
    "Branch": "Finance"
  },
  {
    "ID": 45,
    "Description": "Unexpected expenses are straining your budget. You need to identify areas where spending can be optimized without sacrificing team performance.",
    "Role": "Auditor",
    "Branch": "Finance"
  },
  {
    "ID": 97,
    "Description": "The team is considering offering merchandise to fans, but they’re unsure of the financial implications. Review the team’s current financial systems and processes to ensure they can properly track revenue from merchandise sales, and recommend improvements to prevent potential fraud or accounting errors.",
    "Role": "Auditor",
    "Branch": "Finance"
  },
  {
    "ID": 150,
    "Description": "While reviewing the team’s financial records, you’ve come across several unaccounted-for expenses. These discrepancies could affect the team’s budget and financial transparency.",
    "Role": "Auditor",
    "Branch": "Finance"
  }
]